# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'wp-cli'

# Development
brew 'php'
brew 'php@8.1'
# brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'

# Apps
# cask 'alfred'
# cask 'audio-hijack'
# cask 'bitwarden'
# cask 'brave-browser'
# cask 'camtasia'
# cask 'chronosync'
# cask 'dropbox'
# cask 'discord'
# cask 'easyfind'
# cask 'etrecheckpro'
# cask 'firefox'
# cask 'flycut'
# cask 'forklift'
# cask 'github'
# cask 'google-chrome'
# cask 'handbrake'
# cask 'ilok-license-manager'
# cask 'imageoptim'
# cask 'iterm2'
# cask 'istat-menus'
# cask 'lulu'
# cask 'omnidisksweeper'
# cask 'plex'
# cask 'phpmon'
# cask 'postman-agent'
# cask 'postman'
# cask 'sequel-ace'
# cask 'sketch'
# cask 'skype'
# cask 'slack'
# cask 'spotify'
# cask 'subler'
# cask 'teamviewer'
# cask 'the-unarchiver'
# cask 'tinkerwell'
# cask 'tor-browser'
# cask 'transmission'
# cask 'vlc'
# cask 'vscodium'
# cask 'whatsapp'
# cask 'zeplin'

# Quicklook
# cask 'qlcolorcode'
# cask 'qlmarkdown'
# cask 'quicklook-csv'
# cask 'quicklook-json'

# Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Pages', id:
# mas 'Speedtest', id: 1153157709
# mas 'Things', id: 904280696
